Revit 2027 API
ContinuousRail.GetEndExtensionPath Method
 Retrieves the start extension path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetEndExtensionPath()
Public Function GetEndExtensionPath As IList(Of Curve)
public:
IList<Curve^>^ GetEndExtensionPath()
member GetEndExtensionPath : unit -> IList<Curve>
Return Value
IList<Curve>
 The start extension path of the rail.
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace